update readme and remvoe extra files
